Hello,

Attached is the file of the apply result. Thanks.

On Tue, Jul 9, 2024 at 11:22 PM Francisco Muñoz Miranda <
***@***.***> wrote:

> Could you activate the provider debug and share it?
>
> provider "meraki" {
>   meraki_debug = "true"
> }
>
> export TF_LOG="DEBUG"
>
> —
> Reply to this email directly, view it on GitHub
> <https://github.com/cisco-open/terraform-provider-meraki/issues/91#issuecomment-2219468568>,
> or unsubscribe
> <https://github.com/notifications/unsubscribe-auth/ASBAEWZCX2DA4NTUJM3ZPNDZLSSH5AVCNFSM6AAAAABKHXSZYWVHI2DSMVQWIX3LMV43OSLTON2WKQ3PNVWWK3TUHMZDEMJZGQ3DQNJWHA>
> .
> You are receiving this because you authored the thread.Message ID:
> ***@***.***>
>

2024-07-10T17:10:51.098-0400 [INFO]  OpenTofu version: 1.7.2
2024-07-10T17:10:51.098-0400 [DEBUG] using github.com/hashicorp/go-tfe v1.36.0
2024-07-10T17:10:51.098-0400 [DEBUG] using github.com/opentofu/hcl/v2 v2.0.0-20240416130056-03228b26f391
2024-07-10T17:10:51.098-0400 [DEBUG] using github.com/hashicorp/terraform-svchost v0.1.1
2024-07-10T17:10:51.098-0400 [DEBUG] using github.com/zclconf/go-cty v1.14.4
2024-07-10T17:10:51.098-0400 [INFO]  Go runtime version: go1.22.3
2024-07-10T17:10:51.098-0400 [INFO]  CLI args: []string{"tofu", "apply", "-auto-approve"}
2024-07-10T17:10:51.098-0400 [DEBUG] Attempting to open CLI config file: /Users/tphan/.tofurc
2024-07-10T17:10:51.098-0400 [DEBUG] File doesn't exist, but doesn't need to. Ignoring.
2024-07-10T17:10:51.100-0400 [INFO]  CLI command args: []string{"apply", "-auto-approve"}
2024-07-10T17:10:51.127-0400 [DEBUG] Service discovery for backend.api.env0.com at https://backend.api.env0.com/.well-known/terraform.json
2024-07-10T17:10:51.435-0400 [DEBUG] Service discovery for backend.api.env0.com aliased as localterraform.com
2024-07-10T17:10:51.505-0400 [DEBUG] checking for provisioner in "."
2024-07-10T17:10:51.505-0400 [DEBUG] checking for provisioner in "/opt/homebrew/bin"
2024-07-10T17:10:51.732-0400 [INFO]  cloud: starting Apply operation
Running apply in cloud backend. Output will stream here. Pressing Ctrl-C
will cancel the remote apply if it's still pending. If the apply started it
will stop streaming the logs, but will not stop the apply running remotely.

Preparing the remote apply...

Waiting for the plan to start...

Remote Apply initialized successfully!
downloading and extracting local code
reading Terraform Variables...
Assuming role with configuration:
> /opt/tofuenv/bin/tofu --version
OpenTofu v1.7.2
on linux_amd64
+ provider registry.opentofu.org/cisco-open/meraki v0.2.5-alpha
+ provider registry.opentofu.org/env0/env0 v1.19.0

Looking for terraform-deployer token for .terraformrc generation
env0 terraform-deployer token found - appending credentials to /home/node/.terraformrc
Creating env0 remote backend file...
> /opt/tofuenv/bin/tofu init

Initializing the backend...

Initializing modules...


Initializing provider plugins...
- Reusing previous version of cisco-open/meraki from the dependency lock file

- Reusing previous version of env0/env0 from the dependency lock file

- Installing cisco-open/meraki v0.2.5-alpha...

- Installed cisco-open/meraki v0.2.5-alpha. Signature validation was skipped due to the registry not containing GPG keys for this provider

- Installing env0/env0 v1.19.0...

- Installed env0/env0 v1.19.0 (verified checksum)


OpenTofu has made some changes to the provider dependency selections recorded
in the .terraform.lock.hcl file. Review those changes and commit them to your
version control system if they represent changes you intended to make.

OpenTofu has been successfully initialized!

> /opt/tofuenv/bin/tofu validate
Success! The configuration is valid.

Skipping workspace step
Skipping automatic resource tagging as cost is disabled for this project. To enable cost, please contact your env0 Project Admin
> /opt/tofuenv/bin/tofu plan -detailed-exitcode -out=/tmp/d62ca35a-df89-47d0-a9f3-048a1620e094/.env0workdir/.tf-plan

data.meraki_devices.sensors: Reading...

module.test-Terraform-network.meraki_networks_alerts_settings.network-alerts: Refreshing state...

data.meraki_devices.cmdb_WAPs: Read complete after 2s

data.meraki_devices.sensors: Read complete after 1s


OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

OpenTofu will perform the following actions:

  # meraki_networks_sensor_alerts_profiles.sensor-alerts will be created
  + resource "meraki_networks_sensor_alerts_profiles" "sensor-alerts" {
      + conditions          = [
          + {
              + direction = "above"
              + duration  = 120
              + metric    = "humidity"
              + threshold = {
                  + humidity = {
                      + relative_percentage = 80
                    }
                }
            },
          + {
              + direction = "above"
              + duration  = 300
              + metric    = "temperature"
              + threshold = {
                  + temperature = {
                      + celsius = 29
                    }
                }
            },
          + {
              + direction = "below"
              + duration  = 120
              + metric    = "humidity"
              + threshold = {
                  + humidity = {
                      + relative_percentage = 20
                    }
                }
            },
          + {
              + direction = "below"
              + duration  = 300
              + metric    = "temperature"
              + threshold = {
                  + temperature = {
                      + celsius = 10
                    }
                }
            },
          + {
              + duration  = 0
              + metric    = "noise"
              + threshold = {
                  + noise = {
                      + ambient = {
                          + level = 85
                        }
                    }
                }
            },
          + {
              + duration  = 0
              + metric    = "pm25"
              + threshold = {
                  + pm25 = {
                      + quality = "fair"
                    }
                }
            },
          + {
              + duration  = 0
              + metric    = "tvoc"
              + threshold = {
                  + tvoc = {
                      + quality = "poor"
                    }
                }
            },
          + {
              + duration  = 0
              + metric    = "water"
              + threshold = {
                  + water = {
                      + present = true
                    }
                }
            },
          + {
              + duration  = 600
              + metric    = "indoorAirQuality"
              + threshold = {
                  + indoor_air_quality = {
                      + quality = "poor"
                    }
                }
            },
        ]
      + conditions_response = (known after apply)
      + name                = "Sensor Alerts"
      + network_id          = "L_731271989494298137"
      + profile_id          = (known after apply)
      + recipients          = (known after apply)
      + schedule            = (known after apply)
      + serials             = (known after apply)
    }

  # module.test-Terraform-network.meraki_networks_alerts_settings.network-alerts will be updated in-place
  ~ resource "meraki_networks_alerts_settings" "network-alerts" {
      + muting               = (known after apply)
        # (4 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 0 to destroy.

meraki_networks_sensor_alerts_profiles.sensor-alerts: Creating...

module.test-Terraform-network.meraki_networks_alerts_settings.network-alerts: Modifying...

module.test-Terraform-network.meraki_networks_alerts_settings.network-alerts: Modifications complete after 2s

╷
│ Error: Failure when executing GetNetworkSensorAlertsProfile
│ 
│   with meraki_networks_sensor_alerts_profiles.sensor-alerts,
│   on sensors-alerts.tf line 16, in resource "meraki_networks_sensor_alerts_profiles" "sensor-alerts":
│   16: resource "meraki_networks_sensor_alerts_profiles" "sensor-alerts" {
│ 
│ error with operation GetNetworkSensorAlertsProfile

pressing working directory
Compressing state files
Upload of state files has started...
Upload of state files has finished
Upload of working directory has started...
Upload of working directory has finished